{
    "src_vocab": {
        "<pad>": 0,
        "<sos>": 1,
        "<eos>": 2,
        "create": 3,
        "string": 4,
        "s": 5,
        "integers": 6,
        "x1,": 7,
        "y1,": 8,
        "x2,": 9,
        "y2": 10,
        "read": 11,
        "set": 12,
        "x1": 13,
        "to": 14,
        "s[0]": 15,
        "-": 16,
        "96": 17,
        "y1": 18,
        "s[1]": 19,
        "'0'": 20,
        "x2": 21,
        "print": 22,
        "maximum": 23,
        "of": 24,
        "absolute": 25,
        "value": 26,
        "and": 27,
        "y2,": 28,
        "newline": 29,
        "while": 30,
        "is": 31,
        "not": 32,
        "or": 33,
        "if": 34,
        "greater": 35,
        "than": 36,
        "\"R\"": 37,
        "increment": 38,
        "less": 39,
        "\"L\"": 40,
        "decrement": 41,
        "\"D\"": 42,
        "\"U\"": 43,
        "\"\\n\"": 44,
        "=": 45,
        "Read": 46,
        "0": 47,
        "(x1": 48,
        "x2)": 49,
        "(y1": 50,
        "y2)": 51,
        "!=": 52,
        "OR": 53,
        "TRUE,": 54,
        "do": 55,
        "the": 56,
        "following": 57,
        ",": 58,
        "R": 59,
        "L": 60,
        "D": 61,
        "U": 62,
        "a": 63,
        "new": 64,
        "line": 65,
        "character": 66,
        "array": 67,
        "c1": 68,
        "size": 69,
        "2": 70,
        "c2": 71,
        "c1[0]": 72,
        "c1[1]": 73,
        "c2[0]": 74,
        "c2[1]": 75,
        "vector": 76,
        "ans": 77,
        "add": 78,
        "element": 79,
        "\"RU\"": 80,
        "end": 81,
        "else": 82,
        "\"RD\"": 83,
        "\"LD\"": 84,
        "\"LU\"": 85,
        "for": 86,
        "i": 87,
        "exclusive,": 88,
        "ans[i]": 89,
        "let": 90,
        "be": 91,
        "an": 92,
        "characters": 93,
        "length": 94,
        "strings": 95,
        "||": 96,
        "<": 97,
        "&&": 98,
        "push": 99,
        "into": 100,
        "increase": 101,
        "by": 102,
        "one": 103,
        "c1[1]>": 104,
        ">": 105,
        "decrease": 106,
        "all": 107,
        "elements": 108,
        "with": 109,
        "after": 110,
        "each": 111,
        "n,": 112,
        "m": 113,
        "long": 114,
        "x,": 115,
        "y,": 116,
        "a,": 117,
        "b": 118,
        "s,": 119,
        "s1": 120,
        "n": 121,
        "(s[0]": 122,
        "s1[0])": 123,
        "int(s[1]": 124,
        "s1[1])": 125,
        "-n": 126,
        "x": 127,
        "-m": 128,
        "y": 129,
        "bitwise": 130,
        "n,m": 131,
        "m,": 132,
        "s1[0],": 133,
        "s1[1]": 134,
        "invert": 135,
        "sign": 136,
        "'R'": 137,
        "'L'": 138,
        "'U'": 139,
        "'D'": 140,
        "max": 141,
        "(n)": 142,
        "(m)": 143,
        "now,": 144,
        "goal,": 145,
        "way": 146,
        "100": 147,
        "step,": 148,
        "i,": 149,
        "tstep": 150,
        "now": 151,
        "goal": 152,
        "now[0]": 153,
        "goal[0]": 154,
        "step": 155,
        "now[1]": 156,
        "goal[1]": 157,
        "exclusive": 158,
        "way[increment": 159,
        "step]": 160,
        "-step": 161,
        "tstep]": 162,
        "way[i]": 163,
        "strings.": 164,
        "equal": 165,
        "way[tstep]": 166,
        "'RD'": 167,
        "'LD'": 168,
        "'RU'": 169,
        "'LU'": 170,
        "S": 171,
        "S[0]": 172,
        "49,": 173,
        "S[1]": 174,
        "97": 175,
        "Way": 176,
        "\"\"": 177,
        "integer": 178,
        "counter": 179,
        "true": 180,
        "sign_X": 181,
        "(x2": 182,
        "x1)": 183,
        "/": 184,
        "0,": 185,
        "sigh_Y": 186,
        "sign_Y": 187,
        "(y2": 188,
        "y1)": 189,
        "1": 190,
        "-1": 191,
        "sign_Y,": 192,
        "break": 193,
        "loop": 194,
        "'\\n'": 195,
        "49": 196,
        "empty": 197,
        "WAY": 198,
        "int": 199,
        "abs(x2": 200,
        "otherwise": 201,
        "abs(y2": 202,
        "append": 203,
        "are": 204,
        "both": 205,
        "counter,": 206,
        "10": 207,
        "2d": 208,
        "csx": 209,
        "ctx": 210,
        "sx,": 211,
        "sy,": 212,
        "tx": 213,
        "ty": 214,
        "k": 215,
        "sy": 216,
        "sx": 217,
        "a[k]": 218,
        "6": 219,
        "8": 220,
        "3": 221,
        "5": 222,
        "k-th": 223,
        "4": 224,
        "7": 225,
        "inclusive": 226,
        "a[i]": 227,
        "csx,": 228,
        "tx,": 229,
        "1,": 230,
        "2,": 231,
        "3,": 232,
        "4,": 233,
        "5,": 234,
        "6,": 235,
        "7,": 236,
        "8,": 237,
        "declare": 238,
        "res": 239,
        "as": 240,
        "arguments": 241,
        "returning": 242,
        "return": 243,
        "from": 244,
        "function": 245,
        "-1,": 246,
        "xy": 247,
        "wtih": 248,
        "arguments,": 249,
        "j,": 250,
        "k,": 251,
        "l,": 252,
        "count,": 253,
        "count": 254,
        "to,": 255,
        "vec": 256,
        "from[0],": 257,
        "from[1],": 258,
        "to[0],": 259,
        "to[1]": 260,
        "result": 261,
        "run": 262,
        "vec,": 263,
        "vec[i]": 264,
        "that": 265,
        "returns": 266,
        "char": 267,
        "assign": 268,
        "called": 269,
        "to[0]": 270,
        "xy(x1,": 271,
        "xy(y1,": 272,
        "res(x,": 273,
        "y)": 274,
        "aa,": 275,
        "bb,": 276,
        "bb": 277,
        "aa": 278,
        "values": 279,
        "creat": 280,
        "t": 281,
        "abs(s[0]": 282,
        "t[0])": 283,
        "abs(s[1]": 284,
        "t[1])": 285,
        "t[0]": 286,
        "t[1]": 287,
        "t,": 288,
        "+": 289,
        "+1": 290,
        "l": 291,
        "define": 292,
        "'": 293,
        "symbol": 294,
        "',": 295,
        "d": 296,
        "short": 297,
        "'a'": 298,
        "b,": 299,
        "ints": 300,
        "abs(x": 301,
        "a)": 302,
        "abs(y": 303,
        "b)": 304,
        "d1": 305,
        "d2": 306,
        "abs(d1)": 307,
        "abs(d2)": 308,
        "min": 309,
        "c1,": 310,
        "abs(d1": 311,
        "d2)": 312,
        "minimum": 313,
        "d2,": 314,
        "casted": 315,
        "t[1],": 316,
        "(s[1]": 317,
        "s[i]": 318,
        "variable": 319,
        "inp": 320,
        "inp[0]": 321,
        "inp[1]": 322,
        "'0';": 323,
        "64": 324,
        "c": 325,
        "at": 326,
        "index": 327,
        "r": 328,
        "int;": 329,
        "ctr": 330,
        "dr": 331,
        "d[1]": 332,
        "dc": 333,
        "res[i]": 334,
        "vectors": 335,
        "VI,": 336,
        "VI2,": 337,
        "VI3,": 338,
        "VI4": 339,
        "f": 340,
        "abs(a)": 341,
        "abs(b)": 342,
        "f,": 343,
        "t[0],": 344,
        "c,": 345,
        "int(c)": 346,
        "int(d)": 347,
        "(a": 348,
        "\"RU\\n\"": 349,
        "\"RD\\n\"": 350,
        "\"LU\\n\"": 351,
        "\"LD\\n\"": 352,
        "\"U\\n\"": 353,
        "\"D\\n\"": 354,
        "\"R\\n\"": 355,
        "\"L\\n\"": 356,
        "arrays": 357,
        "ans,": 358,
        "xx": 359,
        "yy": 360,
        "abs(x)": 361,
        "abs(y)": 362,
        "xx,": 363,
        "y1-y2": 364,
        "abs(a": 365,
        "c)": 366,
        "abs(b": 367,
        "d)": 368,
        "start": 369,
        "endless": 370,
        "(b": 371,
        "d),": 372,
        "d,": 373,
        "s2": 374,
        "(s1[0]": 375,
        "s2[0])": 376,
        "(s1[1]": 377,
        "s2[1])": 378,
        "s1[0]": 379,
        "s2[0]": 380,
        "s2[1]": 381,
        "c_x": 382,
        "c_y": 383,
        "d_y": 384,
        "d_x": 385,
        ">=": 386,
        "-y": 387,
        "get": 388,
        "c_x,": 389,
        "d_y,": 390,
        "d_x,": 391,
        "open": 392,
        "file": 393,
        "\"cp.inp\"": 394,
        "reading": 395,
        "\"cp.out\"": 396,
        "writing": 397,
        "abs(s1[0]": 398,
        "abs(s1[1]": 399,
        "\"CP.inp\"": 400,
        "mode": 401,
        "using": 402,
        "stream": 403,
        "stdin": 404,
        "\"CP.out\"": 405,
        "\"w\"": 406,
        "stdout": 407,
        "s1,": 408,
        "s2[1],": 409,
        "\"R\",": 410,
        "\"L\",": 411,
        "\"U\",": 412,
        "\"D\",": 413,
        "reference": 414,
        "in": 415,
        "t1": 416,
        "t2": 417,
        "t2,": 418,
        "abs(s1": 419,
        "t1)": 420,
        "abs(s2": 421,
        "t2)": 422,
        "x[0]": 423,
        "y[0]": 424,
        "x[1]": 425,
        "y[1]": 426,
        "q,": 427,
        "v,": 428,
        "z,": 429,
        "w,": 430,
        "u,": 431,
        "R,": 432,
        "D,": 433,
        "L,": 434,
        "q": 435,
        "q[0]": 436,
        "q[1]": 437,
        "w": 438,
        "G": 439,
        "inclusive,": 440,
        "\"G\"": 441,
        "minimal": 442,
        "sum": 443,
        "times": 444,
        "current": 445,
        "destination": 446,
        "input": 447,
        "udmoves": 448,
        "current[1]": 449,
        "destination[1]": 450,
        "rlmoves": 451,
        "current[0]": 452,
        "destination[0]": 453,
        "abs(udmoves)": 454,
        "abs(rlmoves)": 455,
        "current,": 456,
        "aboslute": 457,
        "rlmoves,": 458,
        "res,": 459,
        "o,": 460,
        "p": 461,
        "o": 462,
        "multiply": 463,
        "int(s)": 464,
        "int(a)": 465,
        "char(int(a)": 466,
        "1)": 467,
        "longs": 468,
        "*": 469,
        "(": 470,
        ")": 471,
        "n1,": 472,
        "n2": 473,
        "n1": 474,
        "n2,": 475,
        "s2)": 476,
        "abs(n1": 477,
        "n2)": 478,
        "startx,": 479,
        "starty,": 480,
        "endx,": 481,
        "endy": 482,
        "startx": 483,
        "starty": 484,
        "'1'": 485,
        "endx": 486,
        "v": 487,
        "starx": 488,
        "v[i]": 489,
        "variables": 490,
        "type": 491,
        "i-th": 492,
        "d=": 493,
        "k=": 494,
        "start,": 495,
        "dest": 496,
        "letter_start": 497,
        "letter_start=start[0]": 498,
        "letter_dest": 499,
        "dest[0]": 500,
        "num_start": 501,
        "start[1]": 502,
        "num_dest": 503,
        "dest[1]": 504,
        "num_dest,": 505,
        "v1,": 506,
        "v2,": 507,
        "v1": 508,
        "a[0]": 509,
        "b[0],": 510,
        "v2": 511,
        "a[1]": 512,
        "b[1]": 513,
        "v1+v2-minimum": 514,
        "b[0]": 515,
        "abs(a[0]": 516,
        "b[0])": 517,
        "abs(a[1]": 518,
        "b[1]);": 519,
        "i1,": 520,
        "i2,": 521,
        "l1": 522,
        "l2": 523,
        "abs(i1": 524,
        "l1)": 525,
        "abs(i2": 526,
        "l2)": 527,
        "i1": 528,
        "i2": 529,
        "l1,": 530,
        "l2,": 531,
        "s1[0]-'a'": 532,
        "s1[1]-'1'": 533,
        "s2[0]-'a'": 534,
        "s2[0]-'1'": 535,
        "str": 536,
        "1000": 537,
        "str[count]": 538,
        "str[i]": 539,
        "y1=": 540,
        "subtract": 541,
        "cx,": 542,
        "cy,": 543,
        "dx,": 544,
        "dy": 545,
        "cy": 546,
        "cx": 547,
        "48": 548,
        "dx": 549,
        "xd,yd": 550,
        "xd": 551,
        "yd": 552,
        "decrementing": 553,
        "can": 554,
        "abs(xd)": 555,
        "abs(yd)": 556,
        "mx": 557,
        "s1[0]-s2[0]": 558,
        "rx": 559,
        "ry": 560,
        "xf": 561,
        "yf": 562,
        "1;": 563,
        "kol": 564,
        "==": 565,
        "kol,": 566,
        "{1,": 567,
        "1}": 568,
        "{0,": 569,
        "-1}": 570,
        "ans[i],": 571,
        "xie,": 572,
        "int(b)": 573,
        "xie": 574,
        "abs(abs(dx)": 575,
        "abs(dy))": 576,
        "abs(dx)": 577,
        "abs(dy)": 578,
        "s1[1]-s2[1]": 579,
        "s1[1]+1": 580,
        "r1,": 581,
        "r2,": 582,
        "=integers": 583,
        "=string": 584,
        "r1": 585,
        "r2": 586,
        "absolute(r1": 587,
        "r2)": 588,
        "absolute(c1": 589,
        "c2)": 590,
        "(r1": 591,
        "abs(r1": 592,
        "abs(c1": 593,
        "strings,": 594,
        "1001": 595,
        "c[0]": 596,
        "c[1]": 597,
        "d[0]": 598,
        "cnt": 599,
        "s[cnt]": 600,
        "content": 601,
        "indices": 602,
        "through": 603,
        "xs,": 604,
        "ys,": 605,
        "xt,": 606,
        "yt": 607,
        "200": 608,
        "xs": 609,
        "ys": 610,
        "xt": 611,
        "l[n]": 612,
        "yt,": 613,
        "yet": 614,
        "yes": 615,
        "l[i]": 616,
        "p1": 617,
        "p2": 618,
        "chars": 619,
        "p2[0]": 620,
        "p1[0],": 621,
        "p2[1]": 622,
        "p1[1];": 623,
        "pointers": 624,
        "(lesser": 625,
        "x)": 626,
        "x--": 627,
        "y--": 628,
        "inline": 629,
        "no": 630,
        "ch": 631,
        "digit": 632,
        "'-',": 633,
        "bitshift": 634,
        "left": 635,
        "fx,": 636,
        "fy,": 637,
        "fx": 638,
        "fy": 639,
        "an[incremented": 640,
        "ans]": 641,
        "an[i]": 642,
        "whitespace": 643,
        "getchar()": 644,
        "'-'": 645,
        "(x": 646,
        "<<": 647,
        "3)": 648,
        "an[ans]": 649,
        "inccrement": 650,
        "gap": 651,
        "characters,": 652,
        "terminated": 653,
        "'\\n',": 654,
        "discard": 655,
        "start[0]": 656,
        "end[0]": 657,
        "end[1]": 658,
        "'R',": 659,
        "'L',": 660,
        "'D',": 661,
        "'U',": 662,
        "hi2": 663,
        "hi2,": 664,
        "abs(x1": 665,
        "abs(hi2": 666,
        "hi2>": 667,
        "b[1])": 668,
        "b[1],": 669,
        "then": 670,
        "U,": 671,
        "ex": 672,
        "ey": 673,
        "flag1": 674,
        "flag2": 675,
        "fabs(ex": 676,
        "sx)": 677,
        "fabs(ey": 678,
        "sy)": 679,
        "flag1,": 680,
        "ex-sx": 681,
        "ey-sy": 682,
        "fabs": 683,
        "argument": 684,
        "s2,": 685,
        "t1,": 686,
        "abs(m)": 687,
        "abs(n)": 688,
        "on": 689,
        "every": 690,
        "iteration": 691,
        "diag": 692,
        "diag2": 693,
        "i1-l1": 694,
        "getint": 695,
        "'9'": 696,
        "b[0]-a[0],": 697,
        "excluisve,": 698,
        "absoluve": 699,
        "integet": 700,
        "b[0]-a[0]": 701,
        "b[1]-a[1]": 702,
        "truthy": 703,
        "'0',": 704,
        "max(fabs(x1": 705,
        "x2),": 706,
        "fabs(y1": 707,
        "y2))": 708,
        "ans--": 709,
        "more": 710,
        "reduce": 711,
        "lessen": 712,
        "fastIo": 713,
        "invoke": 714,
        "MAT": 715,
        "j": 716,
        "MAT[i][j]": 717,
        "LC,": 718,
        "RC,": 719,
        "TR": 720,
        "BR": 721,
        "LC": 722,
        "RC": 723,
        "boolean": 724,
        "first": 725,
        "false": 726,
        "'*'": 727,
        "false,": 728,
        "min_i,": 729,
        "min_j,": 730,
        "max_i,": 731,
        "max_j,": 732,
        "min_i": 733,
        "51,": 734,
        "min_j": 735,
        "51": 736,
        "55": 737,
        "a[i][j]": 738,
        "max_i": 739,
        "max_j": 740,
        "integers,": 741,
        "z": 742,
        "55,": 743,
        "check": 744,
        "mn,": 745,
        "mx,": 746,
        "mn": 747,
        "888888,": 748,
        "s[i][j]": 749,
        "check[i]": 750,
        "m1": 751,
        "m2": 752,
        "444": 753,
        "ar": 754,
        "uper,": 755,
        "lowar,": 756,
        "right": 757,
        "ck": 758,
        "con": 759,
        "ar[i][j]": 760,
        "uper": 761,
        "lowar": 762,
        "left,": 763,
        "'*''": 764,
        "\"*\"": 765,
        "vec[j": 766,
        "m]": 767,
        "h1": 768,
        "stop": 769,
        "h2": 770,
        "until": 771,
        "<=": 772,
        "vec[q": 773,
        "yy,": 774,
        "2e9,": 775,
        "2e9": 776,
        "'*',": 777,
        "66": 778,
        "6666,": 779,
        "c[i][j]": 780,
        "finishx,": 781,
        "finishy,": 782,
        "startx=55,": 783,
        "starty=55": 784,
        "st": 785,
        "st[i][j]": 786,
        "finishx": 787,
        "finishy": 788,
        "90": 789,
        "hangx": 790,
        "4409": 791,
        "coty": 792,
        "4999": 793,
        "tt": 794,
        "xaydung": 795,
        "hang,": 796,
        "cot": 797,
        "void": 798,
        "hang": 799,
        "bao1": 800,
        "bao2": 801,
        "demx": 802,
        "demy": 803,
        "maxx": 804,
        "f[x][col]": 805,
        "f[hang][y]": 806,
        "coty[0]": 807,
        "coty[tt-1]": 808,
        "f[i][cot]": 809,
        "hangx[0]": 810,
        "hangx[tt-1]": 811,
        "f[hang][i]": 812,
        "'.'": 813,
        "f[i][j]": 814,
        "hangx[tt]": 815,
        "coty[tt]": 816,
        "sort": 817,
        "chodoi": 818,
        "\".\"": 819,
        "f[x][cot]": 820,
        "coty[tt": 821,
        "1]": 822,
        "hangx[tt": 823,
        "call": 824,
        "xaydung(i,": 825,
        "j)": 826,
        "100,": 827,
        "-100,": 828,
        "-100": 829,
        "A": 830,
        "A[i][j]": 831,
        "q[i][j]": 832,
        "u": 833,
        "true,": 834,
        "xmin,": 835,
        "xmax,": 836,
        "ymin,": 837,
        "ymax,": 838,
        "xmin": 839,
        "200,": 840,
        "xmax": 841,
        "ymin": 842,
        "ymax": 843,
        "p,": 844,
        "mat": 845,
        "mat[i][j]": 846,
        "e": 847,
        "counting": 848,
        "down": 849,
        "50,": 850,
        "50": 851,
        "substring": 852,
        "r,": 853,
        "arr": 854,
        "arr[i][j]": 855,
        "up,": 856,
        "down,": 857,
        "up": 858,
        "mni,": 859,
        "mnj,": 860,
        "mxi": 861,
        "mxj": 862,
        "mni": 863,
        "INT_MAX,": 864,
        "mnj": 865,
        "miny,": 866,
        "maxy,": 867,
        "minx,": 868,
        "maxx,": 869,
        "miny": 870,
        "maxy": 871,
        "minx": 872,
        "f[i][r]": 873,
        "ch,": 874,
        "ch1,": 875,
        "ch2,": 876,
        "ch3": 877,
        "ch4": 878,
        "ch1": 879,
        "1001,": 880,
        "ch2": 881,
        "x0": 882,
        "y0": 883,
        "0;": 884,
        "s[j]": 885,
        "d[2]": 886,
        "d[3]": 887,
        "d[0],": 888,
        "d[1],": 889,
        "d[2],": 890,
        "d[3],": 891,
        "go": 892,
        "jump": 893,
        "point": 894,
        "=n": 895,
        "label": 896,
        "lx": 897,
        "ly": 898,
        "constant": 899,
        "MOD": 900,
        "1000000007": 901,
        "INF": 902,
        "INF2": 903,
        "1000000007LL": 904,
        "double": 905,
        "EPS": 906,
        "1e-9": 907,
        "min,": 908,
        "minj": 909,
        "maxi,": 910,
        "maxj": 911,
        "-INF": 912,
        "mini": 913,
        "maxi": 914,
        "a1,": 915,
        "a2,": 916,
        "a3": 917,
        "a4": 918,
        "a1": 919,
        "a2": 920,
        "a3,": 921,
        "a4,": 922,
        "lett(n)": 923,
        "errl": 924,
        "lett[i]": 925,
        "err": 926,
        "lett[i][j]": 927,
        "\"": 928,
        "lett[j][i]": 929,
        "alt,": 930,
        "ust,": 931,
        "sag,": 932,
        "sol,": 933,
        "alt": 934,
        "-1000,": 935,
        "ust": 936,
        "1000,": 937,
        "sag": 938,
        "sol": 939,
        "incluisive,": 940,
        "60": 941,
        "mini,": 942,
        "500,": 943,
        "500": 944,
        "endj": 945,
        "ch[i][j]": 946,
        "incrementing": 947,
        "endi": 948,
        "99999999": 949,
        "101": 950,
        "lu,": 951,
        "ru,": 952,
        "ld,": 953,
        "rd,": 954,
        "lu": 955,
        "100000": 956,
        "ld": 957,
        "ru": 958,
        "rd": 959,
        "hi,": 960,
        "hj,": 961,
        "li,": 962,
        "lj": 963,
        "hi": 964,
        "hj": 965,
        "li": 966,
        "flag": 967,
        "lj,": 968,
        "gg": 969,
        "char,": 970,
        "0x3f,": 971,
        "0x3f": 972,
        "m3": 973,
        "m4": 974,
        "map": 975,
        "map[i][j]": 976,
        "map[j][i]": 977,
        "booleans": 978,
        "g": 979,
        "52": 980,
        "g,": 981,
        "X": 982,
        "Y": 983,
        "999999": 984,
        "ok": 985,
        "999,": 986,
        "999": 987,
        "mini1,": 988,
        "mini2,": 989,
        "maxi1,": 990,
        "maxi2,": 991,
        "mini1": 992,
        "60,": 993,
        "mini2": 994,
        "maxi1": 995,
        "maxi2": 996,
        "imx,": 997,
        "imn,": 998,
        "jmx": 999,
        "jmn": 1000,
        "imn": 1001,
        "1222": 1002,
        "imx": 1003,
        "s[k][p]": 1004,
        "-2019,": 1005,
        "-2019": 1006,
        "a[j][i]": 1007,
        "MX": 1008,
        "1e4,": 1009,
        "1e4": 1010,
        "continue": 1011,
        "!s": 1012,
        "e,": 1013,
        "arr1": 1014,
        "arr1[k][l]": 1015,
        "arr1[i][j]": 1016,
        "imin,": 1017,
        "imax,": 1018,
        "jmin": 1019,
        "jmax": 1020,
        "imin": 1021,
        "imex": 1022,
        "str[i][j]": 1023,
        "imax": 1024,
        "jmin,": 1025,
        "jmax,": 1026,
        "max,": 1027,
        "row_min,": 1028,
        "row_max": 1029,
        "row_min": 1030,
        "row_max,": 1031,
        "right,": 1032,
        "c[2]": 1033,
        "c[3]": 1034,
        "9": 1035,
        "11": 1036,
        "fill": 1037,
        "s[(i": 1038,
        "%": 1039,
        "r[(i": 1040,
        "r[i]": 1041,
        "a[(i": 1042,
        "j]": 1043,
        "i=": 1044,
        "arr[j][i]": 1045,
        "34298343": 1046,
        "2193809": 1047,
        "data": 1048,
        "initialized": 1049,
        "data[i]": 1050,
        "data[i][j]": 1051,
        "m1,": 1052,
        "craete": 1053,
        "row": 1054,
        "col": 1055,
        "graph": 1056,
        "start_x": 1057,
        "start_y": 1058,
        "end_x": 1059,
        "end_y": 1060,
        "graph[i][j]": 1061,
        "row,": 1062,
        "Min_X": 1063,
        "Min_Y": 1064,
        "Max_X": 1065,
        "Max_Y,": 1066,
        "Max_Y": 1067,
        "ch[i]": 1068,
        "q[i]": 1069,
        "**sheet": 1070,
        "*[n]": 1071,
        "minRow": 1072,
        "minCol": 1073,
        "maxRow": 1074,
        "maxCol": 1075,
        "sheet[i][j]": 1076,
        "minRow,": 1077,
        "maxRow,": 1078,
        "minCol,": 1079,
        "maxCol,": 1080,
        "pointer": 1081,
        "sheet": 1082,
        "sheet[i]": 1083,
        "**shap": 1084,
        "shap[i]": 1085,
        "newchar[m]": 1086,
        "rows,": 1087,
        "colums,": 1088,
        "rowe": 1089,
        "colume": 1090,
        "user": 1091,
        "shap[i][j]": 1092,
        "loop,": 1093,
        "change": 1094,
        "rows": 1095,
        "name": 1096,
        "colums": 1097,
        "standard": 1098,
        "output": 1099,
        "N": 1100,
        "123": 1101,
        "1e9": 1102,
        "KIOT_camp,": 1103,
        "x3,": 1104,
        "y3,": 1105,
        "x4,": 1106,
        "y4": 1107,
        "exit": 1108,
        "KIOT_camp": 1109,
        "y3": 1110,
        "x3": 1111,
        "x4": 1112,
        "n,m=int": 1113,
        "s=vector": 1114,
        "checktop": 1115,
        "(no": 1116,
        "args,": 1117,
        "int)": 1118,
        "i=0": 1119,
        "j=0": 1120,
        "checkbottom": 1121,
        "i=n-1": 1122,
        "checkleft": 1123,
        "checkright": 1124,
        "i=m-1": 1125,
        "resize": 1126,
        "left=checkleft()": 1127,
        "right=checkright()": 1128,
        "top=checktop()": 1129,
        "bottom=checkbottom()": 1130,
        "i=top": 1131,
        "bottom": 1132,
        "starting": 1133,
        "len": 1134,
        "right-left+1": 1135,
        "n-1": 1136,
        "m-1": 1137,
        "flag=0": 1138,
        "i=u": 1139,
        "j=l": 1140,
        "'#'": 1141,
        "inclusive;": 1142,
        "modulo": 1143,
        "\"#\"": 1144,
        "odd": 1145,
        "where": 1146,
        "a1[i]": 1147,
        "a2[i]": 1148,
        "a3[i]": 1149,
        "a1[m]": 1150,
        "'\\0'": 1151,
        "a2[m]": 1152,
        "a3[m]": 1153,
        "a2[m": 1154,
        "a3[0]": 1155,
        "bitwise-and": 1156,
        "(i": 1157,
        "multiple": 1158,
        "even": 1159,
        "\"#\\n\"": 1160,
        "\".\\n\"": 1161,
        "const": 1162,
        "maxn": 1163,
        "200000": 1164,
        "zw": 1165,
        "make": 1166,
        "pair": 1167,
        "30": 1168,
        "ss,": 1169,
        "sss": 1170,
        "&": 1171,
        "falsy,": 1172,
        "!f": 1173,
        "2)": 1174,
        "temp": 1175,
        "uneven": 1176,
        "=1": 1177,
        ".": 1178,
        "adding": 1179,
        "even[i]": 1180,
        "further": 1181,
        "#": 1182,
        "1e5": 1183,
        "nn": 1184,
        "305": 1185,
        "print('#',": 1186,
        "m)": 1187,
        "print('.',": 1188,
        "method": 1189,
        "different": 1190,
        "flg": 1191,
        "=0,": 1192,
        "odd,": 1193,
        "even,": 1194,
        "lie": 1195,
        "skip": 1196,
        "rest": 1197,
        "filled": 1198,
        "changing": 1199,
        "increasing": 1200,
        "setting": 1201,
        "a[i][0]": 1202,
        "a[i][m": 1203,
        "printing": 1204,
        "cnt,": 1205,
        "sum,": 1206,
        "rem,": 1207,
        "rem": 1208,
        "v3": 1209,
        "make_pair": 1210,
        "long,": 1211,
        "se": 1212,
        "h,": 1213,
        "mod": 1214,
        "pritn": 1215,
        "isn't": 1216,
        "reset": 1217,
        "i=1": 1218,
        "m=": 1219,
        "a[51][51]": 1220,
        "i=i+2": 1221,
        "exclusivem": 1222,
        "i+1": 1223,
        "a[i][j]=.": 1224,
        "exclusive;": 1225,
        "endline": 1226,
        "fastio": 1227,
        "value)": 1228,
        "fastio()": 1229,
        "n,m=long": 1230,
        "(i+1)": 1231,
        "h": 1232,
        "120": 1233,
        "0)": 1234,
        "2000010": 1235,
        "taking": 1236,
        "mul": 1237,
        "1LL": 1238,
        "?": 1239,
        ":": 1240,
        "10000": 1241,
        "((i": 1242,
        "'#')": 1243,
        ">>": 1244,
        "isitright": 1245,
        "j=1": 1246,
        "s=0": 1247,
        "a-1": 1248,
        "v=0": 1249,
        "b-1": 1250,
        "n/2,": 1251,
        "=1,": 1252,
        "l=0": 1253,
        "k=1": 1254,
        "k=2": 1255,
        "1.exclusive,": 1256,
        "bool": 1257,
        "col-1": 1258,
        "=0": 1259,
        "j=m": 1260,
        "20": 1261,
        "[100][100]": 1262,
        "a[i][1]": 1263,
        "but": 1264,
        "last": 1265,
        "equals": 1266,
        "power": 1267,
        "(get": 1268,
        "a,b,modi,": 1269,
        "res=1": 1270,
        "res=(res*a)": 1271,
        "modi": 1272,
        "divide": 1273,
        "a=(a*a)": 1274,
        "dirx=array": 1275,
        "int,": 1276,
        "-1,-1,-1,0,0,1,1,1": 1277,
        "diry=array": 1278,
        "-1,0,1,-1,1,-1,0,1": 1279,
        "dx=array": 1280,
        "-1,1,0,0": 1281,
        "dy=array": 1282,
        "0,0,-1,1": 1283,
        "k,x,y=int,": 1284,
        "sum,ans,cur=0": 1285,
        "n,m,r,c=int": 1286,
        "a=array": 1287,
        "1005": 1288,
        "s,t,r=string": 1289,
        "c=0": 1290,
        "decremented": 1291,
        "(c": 1292,
        "column": 1293,
        "s3": 1294,
        "columns": 1295,
        "**p": 1296,
        "*[n": 1297,
        "assigning": 1298,
        "int[m": 1299,
        "p[i]": 1300,
        "TESTS": 1301,
        "a[n][m]": 1302,
        "j=m-1": 1303,
        "a[n][m]=#": 1304,
        "integer.": 1305,
        "ma": 1306,
        "\"#\",": 1307,
        "iterate": 1308,
        "check,": 1309,
        "lol": 1310,
        "flag=1": 1311,
        "\".\",": 1312,
        "rtr": 1313,
        "c[j]": 1314,
        "c[m]": 1315,
        "4=0": 1316,
        "num": 1317,
        "o=true": 1318,
        "o=false": 1319,
        "a[i][m-1]": 1320,
        "n,m,i,j=int": 1321,
        "part": 1322,
        "c=1": 1323,
        "flag=false": 1324,
        "flag=true": 1325,
        "mxn": 1326,
        "[101][101]": 1327,
        "(j": 1328,
        "m),": 1329,
        "(cnt": 1330,
        "1),": 1331,
        "sizeof(a)": 1332,
        "bytes": 1333,
        "i/2": 1334,
        "event": 1335,
        "c[i][m": 1336,
        "4;": 1337,
        "c[i][0]": 1338,
        "a[i][m]": 1339,
        "a[55]": 1340,
        "m-1,": 1341,
        "j=m-1,": 1342,
        "j=0,": 1343,
        "check=1": 1344,
        "check=0": 1345,
        "statement": 1346,
        "mk": 1347,
        "mx[x][y]": 1348,
        "mk[x": 1349,
        "1][y]": 1350,
        "mk[i][j]": 1351,
        "falsy": 1352,
        "which": 1353,
        "takes": 1354,
        "i*i": 1355,
        "evenly": 1356,
        "divisible": 1357,
        "1000005": 1358,
        "c(i)": 1359,
        "g[l": 1360,
        "i]": 1361,
        "c(i),": 1362,
        "g[i]": 1363,
        "intergers": 1364,
        "g[i],": 1365,
        "YES": 1366,
        "NO": 1367,
        "argument,": 1368,
        "g[l+1+i]": 1369,
        "\"YES\\n\"": 1370,
        "\"NO\\n\"": 1371,
        "SZ": 1372,
        "1003": 1373,
        "isprime": 1374,
        "sieve": 1375,
        "isprime,": 1376,
        "isprime[1]": 1377,
        "isprime[0]": 1378,
        "isprime[i]": 1379,
        "iprime[j]": 1380,
        "primes": 1381,
        "primes[i]": 1382,
        "primes[i": 1383,
        "isprime[num]": 1384,
        "isPrime": 1385,
        "ji": 1386,
        "prime": 1387,
        "isPrime[0]": 1388,
        "isPrime[1]": 1389,
        "isPrime[i]": 1390,
        "p[ji]": 1391,
        "isPrime[j]": 1392,
        "isPrime[j+1]": 1393,
        "p[i+1]": 1394,
        "isPrime[j": 1395,
        "p[i": 1396,
        "ifprime": 1397,
        "squared": 1398,
        "divides": 1399,
        "without": 1400,
        "remainder": 1401,
        "good": 1402,
        "3000": 1403,
        "ifprime(i)": 1404,
        "good[i": 1405,
        "good[i]": 1406,
        "\"YES\"": 1407,
        "\"NO\"": 1408,
        "good[i+last+1]": 1409,
        "1005,": 1410,
        "prime[1]": 1411,
        "falst": 1412,
        "sq": 1413,
        "ceil": 1414,
        "square": 1415,
        "root": 1416,
        "1005+0.0": 1417,
        "prime[j]": 1418,
        "prime[i]": 1419,
        "prime[i": 1420,
        "prn": 1421,
        "pr[i]": 1422,
        "j*j": 1423,
        "next": 1424,
        "pr[j]": 1425,
        "pr[k]": 1426,
        "next[j]": 1427,
        "pr[i": 1428,
        "k]": 1429,
        "next[x]": 1430,
        "primos": 1431,
        "esPrimo": 1432,
        "primo": 1433,
        "esPrimo[i]": 1434,
        "primos[i": 1435,
        "primos[i]": 1436,
        "esPrimo[primos[i": 1437,
        "1],": 1438,
        "n+1,": 1439,
        "primos[i+1]": 1440,
        "1111": 1441,
        "plen": 1442,
        "N,": 1443,
        "p[increment": 1444,
        "plen]": 1445,
        "a[j]": 1446,
        "p[j]": 1447,
        "p[j+1]": 1448,
        "p[plen]": 1449,
        "incresing": 1450,
        "p[j": 1451,
        "num[0]": 1452,
        "num[1]": 1453,
        "num[i]": 1454,
        "num[j]": 1455,
        "2]": 1456,
        "num[sum]": 1457,
        "can[i]": 1458,
        "can[last+i+1]": 1459,
        "can[last": 1460,
        "m[primes[i]": 1461,
        "primes[i-1]": 1462,
        "bitset": 1463,
        "was": 1464,
        "100010": 1465,
        "bits": 1466,
        "was[0]": 1467,
        "was[1]": 1468,
        "was[i]": 1469,
        "m[i]": 1470,
        "was[j]": 1471,
        "bit": 1472,
        "sieve(n)": 1473,
        "sqrt(a)": 1474,
        "fase": 1475,
        "a^2": 1476,
        "divided": 1477,
        "defined,": 1478,
        "1010": 1479,
        "visit": 1480,
        "visit[i]": 1481,
        "p[++*p]": 1482,
        "visit[j]": 1483,
        "*p": 1484,
        "(t": 1485,
        "visit[t]": 1486,
        "\"YES\",": 1487,
        "MAXN": 1488,
        "pd": 1489,
        "find_prime": 1490,
        "pd[0]": 1491,
        "pd[1]": 1492,
        "pd[i]": 1493,
        "[num]": 1494,
        "pd[i": 1495,
        "prime[j]]": 1496,
        "find": 1497,
        "mid": 1498,
        "(l": 1499,
        "r)": 1500,
        "prime[mid]": 1501,
        "mz": 1502,
        "pos": 1503,
        "pd[t]": 1504,
        "find(t)": 1505,
        "prime[pos": 1506,
        "prime[pos]": 1507,
        "prime[MAXN],": 1508,
        "prime[incremented": 1509,
        "num]": 1510,
        "MAXN,": 1511,
        "pd[i*prime[j]]": 1512,
        "pos,": 1513,
        "flag,": 1514,
        "(square": 1515,
        "tmp,": 1516,
        "tmp": 1517,
        "ju": 1518,
        "insert": 1519,
        "iterator": 1520,
        "it": 1521,
        "beginning": 1522,
        "ju,": 1523,
        "{1,1}": 1524,
        "2002": 1525,
        "{0}": 1526,
        "b[p[i]": 1527,
        "b[i]": 1528,
        "a[i],": 1529,
        "puts": 1530,
        "isp": 1531,
        "isprime(i)": 1532,
        "can(s)": 1533,
        "Primes": 1534,
        "Primes[i]": 1535,
        "Primes[0]": 1536,
        "Primes[1]": 1537,
        "Primes[i": 1538,
        "v[j]": 1539,
        "v[j": 1540,
        "20000": 1541,
        "[N": 1542,
        "5]": 1543,
        "fin": 1544,
        "30000": 1545,
        "seive": 1546,
        "f[0]": 1547,
        "f[1]": 1548,
        "f[i]": 1549,
        "exists": 1550,
        "f[j]": 1551,
        "prevI": 1552,
        "2000": 1553,
        "defined": 1554,
        "prime[c]": 1555,
        "memset": 1556,
        "fin,": 1557,
        "test": 1558,
        "fin[test]": 1559,
        "fin[i]": 1560,
        "fin[i-1]": 1561,
        "fin[num]": 1562,
        "prevI,": 1563,
        "prime[0]": 1564,
        "c]": 1565,
        "f[test],": 1566,
        "num,": 1567,
        "File": 1568,
        "output.txt": 1569,
        "input.txt": 1570,
        "fast": 1571,
        "pi": 1572,
        "3.1415926": 1573,
        "1e3": 1574,
        "solve": 1575,
        "arr[x]": 1576,
        "arr[j]": 1577,
        "arr[j": 1578,
        "address": 1579,
        "is_prime": 1580,
        "mark": 1581,
        "mark[i]": 1582,
        "mark[j]": 1583,
        "sqrt(n)": 1584,
        "nextPrime": 1585,
        "isPrime(ans)": 1586,
        "noldbach": 1587,
        "isPrime(i)": 1588,
        "nextPrimeNum": 1589,
        "nextPrime(i)": 1590,
        "noldbach(i)": 1591,
        "error": 1592,
        "otherwise,": 1593,
        "arrar": 1594,
        "check(i)": 1595,
        "(good[i]": 1596,
        "true)": 1597,
        "pri": 1598,
        "168": 1599,
        "a[temp]": 1600,
        "a[j": 1601,
        "increments": 1602,
        "pri(i)": 1603,
        "1000+10,": 1604,
        "1000+10": 1605,
        "num[i],": 1606,
        "prime[increment": 1607,
        "prime[j": 1608,
        "*i": 1609,
        "cin": 1610,
        "!num[i]": 1611,
        "4000": 1612,
        "4000,": 1613,
        "isprime[j]": 1614,
        "binary_search": 1615,
        "prime,": 1616,
        "p[0]": 1617,
        "p[1]": 1618,
        "1009": 1619,
        "ok[i": 1620,
        "incremement": 1621,
        "prime[i-1]+prime[i-2]+1": 1622,
        "num[sum],": 1623,
        "zero": 1624,
        "!num[sum]": 1625,
        "sievesize": 1626,
        "bs": 1627,
        "bs[0]": 1628,
        "bs[1]": 1629,
        "bs[i]": 1630,
        "bs[j]": 1631,
        "primes[j]": 1632,
        "primes[j+1]": 1633,
        "primes[i],": 1634,
        "600,": 1635,
        "putprime": 1636,
        "600": 1637,
        "primes[increment": 1638,
        "point]": 1639,
        "isNoldPrime": 1640,
        "primes[i]*2": 1641,
        "primes[i+1]": 1642,
        "primes[point]": 1643,
        "isprime(x)": 1644,
        "returned": 1645,
        "peimrs[i]": 1646,
        "<=x": 1647,
        "isNoldPrime(i)": 1648,
        "judge": 1649,
        "a[u]": 1650,
        "ii": 1651,
        "a[s]": 1652,
        "ii,": 1653,
        "a[r": 1654,
        "a[r]": 1655,
        "sqrt": 1656,
        "tp": 1657,
        "cm": 1658,
        "lt": 1659,
        "tp(let": 1660,
        "integer)": 1661,
        "has": 1662,
        "cm(let": 1663,
        "tp(i)": 1664,
        "assigned": 1665,
        "cm(p)": 1666,
        "YES,": 1667,
        "character,": 1668,
        "flush": 1669,
        "condition": 1670,
        "met": 1671,
        "so": 1672,
        "NO,": 1673,
        "0}": 1674,
        "2002,": 1675,
        "pp,": 1676,
        "1111,": 1677,
        "pp": 1678,
        "2222,": 1679,
        "2222": 1680,
        "pm": 1681,
        "modulus": 1682,
        "pm2": 1683,
        "prime[i],": 1684,
        "prime[j],": 1685,
        "prime[i+j+1],": 1686,
        "pp[i+j+1]": 1687,
        "cnt[i]": 1688,
        "cnt[i-1]": 1689,
        "pp[i]": 1690,
        "cnt[n]": 1691,
        "newline\"": 1692,
        "pv": 1693,
        "pv[i]": 1694,
        "pv[i": 1695,
        "ok(i": 1696,
        "oolean": 1697,
        "pv[i+1]": 1698,
        "lt,": 1699,
        "ok[i]": 1700,
        "ok[lt": 1701,
        "ok[lt+i+1]": 1702,
        "os": 1703,
        "prime[num]": 1704,
        "find_prime()": 1705,
        "mz(prime[i])": 1706,
        "100001": 1707,
        "check(s)": 1708,
        "1000010": 1709,
        "phi": 1710,
        "primesize": 1711,
        "register": 1712,
        "isdigit": 1713,
        "isprime[r]": 1714,
        "getlist": 1715,
        "listsize,": 1716,
        "listsize": 1717,
        "primesize]": 1718,
        "isprime[i*prime[j]]": 1719,
        "read,": 1720,
        "pre": 1721,
        "init": 1722,
        "prime[cnt]": 1723,
        "check(t),": 1724,
        "pre[t]": 1725,
        "pre[i]": 1726,
        "+=": 1727,
        "pre[i": 1728,
        "pre[n]": 1729,
        "check(t)": 1730,
        "get_prime": 1731,
        "sizeof(x)": 1732,
        "*it": 1733,
        "x[q]": 1734,
        "get_prime()": 1735,
        "x[i]": 1736,
        "instance": 1737,
        "w=": 1738,
        "prime[": 1739,
        "]": 1740,
        "euql": 1741,
        "a[sum]": 1742,
        "prime[k]": 1743,
        "86": 1744,
        "steps": 1745,
        "cnd": 1746,
        "pre,": 1747,
        "cnt]": 1748,
        "prime[i-1]+1": 1749,
        "pre[i-1]": 1750,
        "87": 1751,
        "87,": 1752,
        "g[": 1753,
        "rounded": 1754,
        "v[i": 1755,
        "check(v[i]": 1756,
        "book": 1757,
        "is_p": 1758,
        "is_p[i]": 1759,
        "is_p[0]": 1760,
        "is_p[1]": 1761,
        "is_p[j]": 1762,
        "p[i+1]+1": 1763,
        "is_p[p[i]": 1764,
        "book[p[i]": 1765,
        "book[i]": 1766,
        "(power((x": 1767,
        "m))": 1768,
        "power((x": 1769,
        "Seive": 1770,
        "n+1,true": 1771,
        "is_prime[0]": 1772,
        "is_prime[1]": 1773,
        "is_prime[i]": 1774,
        "is_prime[j]": 1775,
        "prime[j+1]": 1776,
        "CalculatePrimes": 1777,
        "&primes": 1778,
        "limit": 1779,
        "CalculatePrimes(primes,": 1780,
        "limit)": 1781,
        "sums": 1782,
        "primes,": 1783,
        "sums[i]": 1784,
        "limit,": 1785,
        "primes.size()": 1786,
        "test,": 1787,
        "primes.size(),": 1788,
        "sums.push_back(primes[i]": 1789,
        "sums.size()": 1790,
        "find(primes.begin(),": 1791,
        "primes.end(),": 1792,
        "sums[i])": 1793,
        "inf": 1794,
        "1e18": 1795,
        "is(i)": 1796,
        "vec[i": 1797,
        "is(vec[i]": 1798,
        "x=int": 1799,
        "y=x/2": 1800,
        "z=0": 1801,
        "x-2*y": 1802,
        "y=0": 1803,
        "y=1": 1804,
        "x/2": 1805,
        "abs": 1806,
        "cont": 1807,
        "star": 1808,
        "display": 1809,
        "tmp/2": 1810,
        "(tmp": 1811,
        "i)": 1812,
        "dCount,": 1813,
        "starCount": 1814,
        "dCount": 1815,
        "decreasing": 1816,
        "(2": 1817,
        "mf": 1818,
        "tr": 1819,
        "(n": 1820,
        "read(i,": 1821,
        "max_n": 1822,
        "show": 1823,
        "float": 1824,
        "ceil(n": 1825,
        "draw": 1826,
        "202": 1827,
        "201": 1828,
        "\"n%2==0||n": 1829,
        "201\"": 1830,
        "draw[i][k]": 1831,
        "Mid": 1832,
        "DiamondCount": 1833,
        "draw[i][Mid": 1834,
        "draw[i]": 1835,
        "abs(mid": 1836,
        "i),": 1837,
        "(abs(mid": 1838,
        "i))),": 1839,
        "c=array": 1840,
        "110": 1841,
        "n,l,r=int": 1842,
        "c[i][j]='*'": 1843,
        "n/2+1": 1844,
        "r<=n": 1845,
        "l>=1": 1846,
        "c[i][j]='D'": 1847,
        "r>=l": 1848,
        "keep": 1849,
        "it,": 1850,
        "going": 1851,
        "further,": 1852,
        "doubles": 1853,
        "301": 1854,
        "\"*\",": 1855,
        "(p": 1856,
        "abs(i)": 1857,
        "abs(j)": 1858,
        "abs(i": 1859,
        "abs(j": 1860,
        "numD": 1861,
        "numStar": 1862,
        "kkk": 1863,
        "pair<int,": 1864,
        "int>": 1865,
        "(a.first": 1866,
        "b.first),": 1867,
        "(a.second": 1868,
        "b.second)": 1869,
        "b.first)": 1870,
        "inc": 1871,
        "(pointer": 1872,
        "k)": 1873,
        "(abs((n": 1874,
        "p)": 1875,
        "iskom": 1876,
        "k1": 1877,
        "dem": 1878,
        "dem)": 1879,
        "dem,": 1880,
        "MD": 1881,
        "1000000009": 1882,
        "2e3": 1883,
        "33": 1884,
        "2))": 1885,
        "n=int": 1886,
        "s=array": 1887,
        "n/2": 1888,
        "n/2-i": 1889,
        "s[i][j]='D'": 1890,
        "s[i][j]='*'": 1891,
        "j=n/2+1": 1892,
        "s[i][n-j-1]": 1893,
        "i=n/2+1": 1894,
        "s[n-i-1][j]": 1895,
        "sized": 1896,
        "matrix": 1897,
        "arr[i][k]": 1898,
        "/2": 1899,
        "n/2-1": 1900,
        "write": 1901,
        "star,": 1902,
        "M,": 1903,
        "K,": 1904,
        "H,": 1905,
        "W,": 1906,
        "1000x1000": 1907,
        "a[k][j]": 1908,
        "a[n/2][i]": 1909,
        "forij": 1910,
        "(1": 1911,
        "n)": 1912,
        "key": 1913,
        "modpow": 1914,
        "x,n,m,": 1915,
        "long)": 1916,
        "u=modpow(x,n/2,m)": 1917,
        "u=(u*u)": 1918,
        "u=(u*x)": 1919,
        "n,k=int,": 1920,
        "tt=0": 1921,
        "e=0": 1922,
        "p=0": 1923,
        "(n-k)/2": 1924,
        "tt=1": 1925,
        "n,count": 1926,
        "minus": 1927,
        "(mid": 1928,
        "cnt)": 1929,
        "table": 1930,
        "[MAXN][MAXN]": 1931,
        "half": 1932,
        "table[i][j]": 1933,
        "exlclusive": 1934,
        "(half": 1935,
        "i)),": 1936,
        "table[half][i]": 1937,
        "table[u][j]": 1938,
        "1))": 1939,
        "102": 1940,
        "a[n": 1941,
        "1][j]": 1942,
        "Size": 1943,
        "(Size": 1944,
        "nothing)": 1945,
        "abs(i-n/2)+abs(j-n/2)": 1946,
        "A(n)": 1947,
        "printDiamond": 1948,
        "diamond": 1949,
        "dotNum": 1950,
        "diamond)": 1951,
        "x[a][n": 1952,
        "b]": 1953,
        "x[i][j]": 1954,
        "(n/2": 1955,
        "plus": 1956,
        "print(i,": 1957,
        "a[i][p": 1958,
        "a[i][k]": 1959,
        "between": 1960,
        "m-i": 1961,
        "m+i": 1962,
        "abort": 1963,
        "program": 1964,
        "md": 1965,
        "endl": 1966,
        "sz,": 1967,
        "s3,": 1968,
        "s4,": 1969,
        "s5,": 1970,
        "s6": 1971,
        "10,": 1972,
        "ar2": 1973,
        "brainfuck": 1974,
        "=int": 1975,
        "(n-i*2-1)/2,": 1976,
        "i*2+1,": 1977,
        "(n-i2*2-1)/2,": 1978,
        "i2*2+1,": 1979,
        "icrement": 1980,
        "stars": 1981,
        "ds": 1982,
        "mp": 1983,
        "q[i][f]": 1984,
        "\"\",": 1985,
        "a[mid]": 1986,
        "mid,": 1987,
        "mid),": 1988,
        "(n-(2*i+1))/2": 1989,
        "x=0": 1990,
        "2*i+1": 1991,
        "o=0": 1992,
        "i=n-2-1": 1993,
        "(k": 1994,
        "(abs(m": 1995,
        "v)": 1996,
        "(m": 1997,
        "i+2": 1998,
        "n-i/2": 1999,
        "n-i/2,": 2000,
        "i=n-2": 2001,
        "n+i/2": 2002,
        "t)": 2003,
        "\\n": 2004,
        "i,j,n": 2005,
        "2.0)": 2006,
        "accepts": 2007,
        "modpow(x,": 2008,
        "(u": 2009,
        "u)": 2010,
        "x-i": 2011,
        "x+i": 2012,
        "od": 2013,
        "boost": 2014,
        "times,": 2015,
        "Vector": 2016,
        "Vector[k]": 2017,
        "Vector[m]": 2018,
        "star_count": 2019,
        "d_count": 2020,
        "integer,": 2021,
        "back": 2022,
        "looping": 2023,
        "nprint": 2024,
        "0x3f3f3f3f": 2025,
        "n),": 2026,
        "nd": 2027,
        "ns": 2028,
        "nd)": 2029,
        "out": 2030,
        "arr[i": 2031,
        "arr[i][j": 2032,
        "out[i][j]": 2033,
        "t3": 2034,
        "b[i][j]": 2035,
        "b[0][0]": 2036,
        "(b[0][0]": 2037,
        "b[0][1]": 2038,
        "(b[0][1]": 2039,
        "b[1][0]": 2040,
        "(b[1][0]": 2041,
        "b[0][2]": 2042,
        "(b[0][2]": 2043,
        "b[1][1]": 2044,
        "(b[1][1]": 2045,
        "b[1][2]": 2046,
        "(b[1][2]": 2047,
        "b[2][0]": 2048,
        "(b[2][0]": 2049,
        "b[2][1]": 2050,
        "(b[2][1]": 2051,
        "b[2][2]": 2052,
        "(b[2][2]": 2053,
        "l[i][j]": 2054,
        "l[i-1][j]": 2055,
        "l[i+1][j]": 2056,
        "l[i][j-1]": 2057,
        "l[i][j+1]": 2058,
        "arr2": 2059,
        "{{1,": 2060,
        "1},": 2061,
        "1}}": 2062,
        "colom": 2063,
        "arr[row][colom]": 2064,
        "arr2[row][colom]": 2065,
        "arr2[row][colom": 2066,
        "arr2[row": 2067,
        "1][colom]": 2068,
        "b[i": 2069,
        "b[i][j": 2070,
        "toggle": 2071,
        "number,": 2072,
        "a[i][j]=1": 2073,
        "input=array": 2074,
        "input[i][j]": 2075,
        "input[i][j]=input[i][j]": 2076,
        "toggle(a[i][j])": 2077,
        "a[i][j+1]": 2078,
        "toggle(a[i][j+1])": 2079,
        "a[i+1][j]": 2080,
        "toggle(a[i+1][j])": 2081,
        "a[i][j-1]": 2082,
        "toggle(a[i][j-1])": 2083,
        "a[i-1][j]": 2084,
        "toggle(a[i-1][j])": 2085,
        "containing": 2086,
        "Assign": 2087,
        "(int": 2088,
        "*)a": 2089,
        "sizeof(int)": 2090,
        "abs(1": 2091,
        "a[i][j])": 2092,
        "a[i][abs(j": 2093,
        "1)]": 2094,
        "1)])": 2095,
        "a[abs(i": 2096,
        "1)][j]": 2097,
        "1)][j])": 2098,
        "1)][(j)])": 2099,
        "a[0][1]": 2100,
        "a[2][1]": 2101,
        "a[1][0]": 2102,
        "a[1][2]": 2103,
        "a[x]": 2104,
        "v[i][j]": 2105,
        "n[i][j]": 2106,
        "n[i+1][j]": 2107,
        "n[i-1][j]": 2108,
        "n[i][j+1]": 2109,
        "n[i][j-1]": 2110,
        "arr,": 2111,
        "l[i": 2112,
        "l[i][j": 2113,
        "2e5": 2114,
        "[5][5]": 2115,
        "off_or_on": 2116,
        "a[i": 2117,
        "a[i][j": 2118,
        "bin": 2119,
        "in[i]": 2120,
        "bin[i]": 2121,
        "!bin[i]": 2122,
        "bin[i": 2123,
        "9,": 2124,
        "3]": 2125,
        "two": 2126,
        "dimensional": 2127,
        "sizes": 2128,
        "light": 2129,
        "light[i][j]": 2130,
        "C": 2131,
        "n_i": 2132,
        "R[k]": 2133,
        "n_j": 2134,
        "C[k]": 2135,
        "light[n_i][n_j]": 2136,
        "{0},": 2137,
        "[4][4]": 2138,
        "a[t][k]": 2139,
        "b[t][k]": 2140,
        "a[t][k": 2141,
        "a[t": 2142,
        "1][k]": 2143,
        "dimensions": 2144,
        "c[i": 2145,
        "c[i][j": 2146,
        "pole": 2147,
        "naj": 2148,
        "pole[i][j]": 2149,
        "iii": 2150,
        "pole[i][iii]": 2151,
        "pole[i][ii]": 2152,
        "pole[i+1][ii]": 2153,
        "pole[i-1][ii]": 2154,
        "pole[i][ii+1]": 2155,
        "pole[i][ii-1]": 2156,
        "isvalid": 2157,
        "((r": 2158,
        "3))": 2159,
        "[j]": 2160,
        "isvalid(i": 2161,
        "s[i": 2162,
        "isvalid(i,": 2163,
        "s[i][j": 2164,
        "curr": 2165,
        "actions": 2166,
        "actions[i][j]": 2167,
        "curr[i][j]": 2168,
        "curr[i][j": 2169,
        "curr[i": 2170,
        "a,b": 2171,
        "AND": 2172,
        "NOT": 2173,
        "b[i][j],": 2174,
        "b[i-1][j]": 2175,
        "b[i-1][j],": 2176,
        "b[i+1][j]": 2177,
        "b[i][j-1]": 2178,
        "b[i][j-1],": 2179,
        "b[i][j+1]": 2180,
        "a[k][l]": 2181,
